# InvalidStartLevel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..InvalidStartLevel Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The start level and end level for this staircase must be at different elevations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidStartLevel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidStartLevel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidStartLevel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace